In [ ]:
#project02_advanced ini untuk melakukan filtering baris sesuai kondisi, group by data, merge data, serta melakukan pivot table

In [5]:
#import pandas & csv
import pandas as pd

In [15]:
df = pd.read_csv('C:/Users/LENOVO/Documents/ppython/titanic/train_cleaned.csv')

In [16]:
df.head()

,PassengerId,Survived,Pclass,Name,Age,SibSp,Parch,Ticket,Fare,Cabin,Sex_male,Embarked_Q,Embarked_S
0,1,0,3,"Braund, Mr. Owen Harris",22.0,1,0,A/5 21171,7.2500,NaN,True,False,True
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",38.0,1,0,PC 17599,71.2833,C85,False,False,False
2,3,1,3,"Heikkinen, Miss. Laina",26.0,0,0,STON/O2. 3101282,7.9250,NaN,False,False,True
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",35.0,1,0,113803,53.1000,C123,False,False,True
4,5,0,3,"Allen, Mr. William Henry",35.0,0,0,373450,8.0500,NaN,True,False,True

In [33]:
#1. Filtering data: melakukan filter row yang berumur > 60
df[df["Age"]>60].count()

PassengerId    22
Survived       22
Pclass         22
Name           22
Age            22
SibSp          22
Parch          22
Ticket         22
Fare           22
Cabin          11
Sex_male       22
Embarked_Q     22
Embarked_S     22
dtype: int64

In [37]:
#Melakukan group by rata - rata umur berdasarkan kelas
df.groupby("Pclass")["Age"].mean()

Pclass
1    36.812130
2    29.765380
3    25.932627
Name: Age, dtype: float64

In [39]:
# Melakukan group by survival rate per gender
df.groupby("Sex_male")["Survived"].mean()

Sex_male
False    0.742038
True     0.188908
Name: Survived, dtype: float64

In [41]:
# melakukan Merge 2 data frame
# memanggil train.csv sebagai df2
df2 = pd.read_csv('C:/Users/LENOVO/Documents/ppython/titanic/train.csv')

In [42]:
# melakukan Merge 2 data frame berdasarkan Pclass
df_merged = pd.merge(df, df2, on="Pclass", how="left", suffixes=('_df1', '_df2'))

In [47]:
print(df_merged.columns)

Index(['PassengerId_df1', 'Survived_df1', 'Pclass', 'Name_df1', 'Age_df1',
       'SibSp_df1', 'Parch_df1', 'Ticket_df1', 'Fare_df1', 'Cabin_df1',
       'Sex_male', 'Embarked_Q', 'Embarked_S', 'PassengerId_df2',
       'Survived_df2', 'Name_df2', 'Sex', 'Age_df2', 'SibSp_df2', 'Parch_df2',
       'Ticket_df2', 'Fare_df2', 'Cabin_df2', 'Embarked'],
      dtype='object')

In [50]:
# menyimpan csv hasil merged
df_merged.to_csv("C:/Users/LENOVO/Documents/ppython/titanic/train_merged.csv",index=False)

In [54]:
# membuat pivot table
#Pivot table survival rate berdasarkan gender dan kelas.
#df=data sumber
#value= sebagai metric
#index= sebagai row
# columns= sebagai kolom
#aggfunc= sebagai jenis agregasi
pd.pivot_table(
    df,
    values ="Survived",
    index = "Pclass",
    columns= "Sex_male",
    aggfunc= "mean"
)

Sex_male     False     True
Pclass
1         0.968085  0.368852
2         0.921053  0.157407
3         0.500000  0.135447

In [ ]:
#kesimpulan: 
#sex_male = true adalah pria, sex_male = false adalah wanita
#tingkat survival rate wanita lebih tinggi dibandingkan pria terutama di kelas 1 dan 2 diatas 0.9 
# tingkat survival laki- laki lebih rendah disemua kelas
# tingkat survival menurun seiring penurunan kelas dari 1 ke 2 ke 3. 
#menunjukkan bahwa tingkat kelas sosial juga berpengaruh kepada penentu kelangsungan hidup.